Documents/ДвижениеОбучающихся.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Document>
		<Properties>
			<Name>ДвижениеОбучающихся</Name>
			<BasedOn>
				<xr:Item>Catalog.Обучающиеся</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ДвиженияОбучающихся</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчебныйГод</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчебныеГода</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Класс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Классы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДвиженияОбучающегося</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Литера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Обучающиеся</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФИО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Обучающиеся</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отличник</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Условно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Класс</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Классы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ДвиженияОбучающихся.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ДвиженияОбучающихся</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Класс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Классы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УчебныйГод</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчебныеГода</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчислен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТипДвижения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДвиженияОбучающегося</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Условно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Обучающийся</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Обучающиеся</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыДвиженияОбучающегося.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ТипыДвиженияОбучающегося</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НовыйУчебныйГод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереходМеждуКлассами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемНаОбучение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отчисление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОкончаниеОбучения</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Классы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Catalog>
		<Properties>
			<Name>Классы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Параллель</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Параллели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Литера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/ДвижениеОбучающихся/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ Параметры.Свойство("Обучающиеся") Тогда
		Возврат;
	КонецЕсли;
		
	Для каждого Обучающийся Из Параметры.Обучающиеся Цикл
       Строка = Объект.Обучающиеся.Добавить();
	   Строка.ФИО = Обучающийся;
   КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТипДокументаПриИзменении(Элемент)
	НовоеЗначение = Объект.ТипДокумента;
	ОтобразитьПоля(НовоеЗначение);
	//ОтобразитьКлассы();
КонецПроцедуры


&НаСервере
Процедура ОтобразитьПоля(ТипДокумента)  
	
	Если ТипДокумента = Перечисления.ТипыДвиженияОбучающегося.ПустаяСсылка() Тогда
		Элементы.УчебныйГод.Видимость = Ложь;
		Элементы.ГруппаУстановитьКласс.Видимость = Ложь;
		Элементы.ОбучающиесяКласс.Видимость = Ложь;
		Элементы.Комментарий.Видимость = Ложь;   
		Элементы.ОбучающиесяОтличник.Видимость = Ложь;
		Элементы.ОбучающиесяУсловно.Видимость = Ложь;
		Элементы.ЗаполнитьКлассы.Видимость = Ложь; 
	ИначеЕсли ТипДокумента = Перечисления.ТипыДвиженияОбучающегося.Отчисление Тогда
		Элементы.УчебныйГод.Видимость = Ложь;
		Элементы.ГруппаУстановитьКласс.Видимость = Ложь; 
		Элементы.ОбучающиесяКласс.Видимость = Ложь;
		Элементы.Комментарий.Видимость = Истина;
    	Элементы.ОбучающиесяОтличник.Видимость = Ложь; 
		Элементы.ОбучающиесяУсловно.Видимость = Ложь;
		Элементы.ЗаполнитьКлассы.Видимость = Ложь;
	ИначеЕсли ТипДокумента = Перечисления.ТипыДвиженияОбучающегося.ОкончаниеОбучения Тогда
		Элементы.УчебныйГод.Видимость = Ложь;
		Элементы.ГруппаУстановитьКласс.Видимость = Ложь;
		Элементы.ОбучающиесяКласс.Видимость = Ложь;
		Элементы.Комментарий.Видимость = Ложь;
		Элементы.ОбучающиесяОтличник.Видимость = Истина;
		Элементы.ОбучающиесяУсловно.Видимость = Ложь;
		Элементы.ЗаполнитьКлассы.Видимость = Ложь;
	ИначеЕсли ТипДокумента = Перечисления.ТипыДвиженияОбучающегося.НовыйУчебныйГод Тогда
		Элементы.УчебныйГод.Видимость = Истина;
		Элементы.ГруппаУстановитьКласс.Видимость = Истина; 
		Элементы.ОбучающиесяКласс.Видимость = Истина;
		Элементы.Комментарий.Видимость = Ложь;
		Элементы.ОбучающиесяОтличник.Видимость = Ложь;
		Элементы.ОбучающиесяУсловно.Видимость = Истина;
		Элементы.ЗаполнитьКлассы.Видимость = Истина;
	Иначе
		Элементы.УчебныйГод.Видимость = Истина;
		Элементы.ГруппаУстановитьКласс.Видимость = Истина;
		Элементы.ОбучающиесяКласс.Видимость = Истина;
		Элементы.Комментарий.Видимость = Ложь;	
		Элементы.ОбучающиесяОтличник.Видимость = Ложь;
		Элементы.ОбучающиесяУсловно.Видимость = Ложь;
		Элементы.ЗаполнитьКлассы.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОтобразитьПоля(Объект.ТипДокумента);
КонецПроцедуры 

&НаКлиенте
Процедура ЗаполнитьКлассы(Команда)
	ЗаполнитьКлассыНаСервере();	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКлассыНаСервере()
	Если Объект.ДатаДействия = '00010101' Тогда
			Сообщить("Дата действия не задана");
			Возврат;
	КонецЕсли; 
						  				
	
	ЗапросОбучающиеся = Новый Запрос("ВЫБРАТЬ
							  		|Движения.Обучающийся Как ФИО,
							  		|Движения.Класс Как КлассОтчисления,
									|Классы.Ссылка  Как КлассЗачисления,
									|Движения.Класс.Параллель.Порядок + 1 Как ПараллельОтчисления
							  		|ИЗ 
							  		|РегистрСведений.ДвиженияОбучающихся.СрезПоследних(&ДатаДействия) Как Движения 
									|ЛЕВОЕ СОЕДИНЕНИЕ
									|Справочник.Классы Как Классы
									|ПО 
									|	Движения.Класс.Параллель.Порядок + 1 = Классы.Параллель.Порядок 
									|	И Движения.Класс.Литера = Классы.Литера
							 		|ГДЕ 
									|   Движения.Отчислен = Ложь
									|	И Движения.Класс.Параллель.Порядок+1 <> 9 
									|	И Движения.Класс.Параллель.Порядок+1 <> 11");
	ЗапросОбучающиеся.Параметры.Вставить("ДатаДействия", Объект.ДатаДействия - 60*60*24*1);
	Обучающиеся = ЗапросОбучающиеся.Выполнить().Выбрать();
		
	Пока Обучающиеся.Следующий() Цикл 
		КлассЗачисления = Обучающиеся.КлассЗачисления;
		Если Обучающиеся.КлассЗачисления = Справочники.Классы.ПустаяСсылка() ИЛИ Обучающиеся.КлассЗачисления = NULL Тогда
			Если Обучающиеся.КлассОтчисления <> Справочники.Классы.ПустаяСсылка() И Обучающиеся.КлассОтчисления <> NULL Тогда
				ВремСтрока = Строка(Обучающиеся.ПараллельОтчисления+1) + " " + Обучающиеся.КлассОтчисления.Литера;
				КлассЗачисления = ПолучитьКлассИзСтроки(ВремСтрока);
			КонецЕсли;	
		КонецЕсли;
		
		НоваяСтрока = Объект.Обучающиеся.Добавить();
		НоваяСтрока.ФИО = Обучающиеся.ФИО;
		НоваяСтрока.Отличник = Ложь;
		НоваяСтрока.Условно = Ложь;
		НоваяСтрока.Класс = КлассЗачисления;
	КонецЦикла;
			
КонецПроцедуры


&НаКлиенте
Процедура УстановитьКлассВыбранным(Команда)
	Для каждого ВыделеннаяСтрока Из Элементы.Обучающиеся.ВыделенныеСтроки Цикл
       Элементы.Обучающиеся.ДанныеСтроки(ВыделеннаяСтрока).Класс = КлассВыбор;
   КонецЦикла;
КонецПроцедуры
